Revit 2016 API
PlanarFace.Normal Property
Normal of the planar surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016.  Use the FaceNormal property or Face.ComputeNormal() instead.")]
public XYZ Normal { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016.  Use the FaceNormal property or Face.ComputeNormal() instead.")> _
Public ReadOnly Property Normal As XYZ
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016.  Use the FaceNormal property or Face.ComputeNormal() instead.")]
public:
property XYZ^ Normal {
	XYZ^ get ();
}
Remarks
This property is the "surface normal" vector. This is not necessarily the normal vector pointing out of the solid that contains the face, to get that value use ComputeNormal(UV) or FaceNormal
See Also
PlanarFace Class
Autodesk.Revit.DB Namespace